galrene/bi-src/bi-src-pic24-all-labs_v9/src/sources/Microchip/PIC24F_StarterKit_OLED.c
// DRN adaptation to drive PIC24F Starter Kit's SH1101A OLED display
// Dave.Nadler@Nadler.com 15-August-2012

/*
 * Warning !  This code uses some Microchip-distributed graphics
 * support. Microchip's code works but beware of horrendous global
 * names like "DeviceRead" - there's no intelligent name prefixing to
 * separate code for numerous different kind of devices - and lots of
 * globals...
 *
 * The code below provides a few primitives to support FreeRTOS
 * PIC24F demonstration code access to the OLED SH1101 display on
 * Microchip's PIC24F Starter Kit board.
 *
*/


#include "PIC24F_StarterKit_OLED.h" // public interface to this module

#include "HardwareProfile.h" // project-specific hardware configuration
#include "GraphicsConfig.h"  // project-specific configuration of Microchip Graphics Library
#include "Graphics/Graphics.h"  // Microchip Graphics library (ClearDevice, PutPixel, _color)
#include "Graphics/gfxpmp.h"    // Microchip PMP driver support (DriverInterfaceInit, ROM, DeviceRead, DeviceWrite)

// Map gfxpmp functions to names used in PIC24F OLED_ .c code below
#define OLED_Read()           DeviceRead()      // Unbelievable name; code in SH1101 driver
#define OLED_Write(_x)        DeviceWrite((_x)) // Unbelievable name; code in SH1101 driver
#define OLED_WriteCommand(_x) {OLED_SetCommand(); DeviceWrite((_x));}
#define OLED_WriteData(_x)    {OLED_SetData();    DeviceWrite((_x));}

#define OFFSET  2 // Defines the display offset in x direction (WTF ???).



/*********************************************************************
* Function: OLED_Init
* Overview: 
* Input:
* Output: 
********************************************************************/
void OLED_Init(void)
{
    DriverInterfaceInit(); // initialize PMP parallel port (definition in gfxpmp.h)

    // Initialize the MCU pins
    OLED_ConfigPins();
    OLED_Select();
    OLED_SetCommand();

    // Setup Display
    OLED_Write(0xAE);             // turn off the display (AF=ON, AE=OFF)
    OLED_Write(0xDB);             // set  VCOMH
    OLED_Write(0x23);
    OLED_Write(0xD9);             // set  VP
    OLED_Write(0x22);

    // Re-map
    OLED_Write(0xA1);             // [A0]:column address 0 is map to SEG0
                                  // [A1]:column address 131 is map to SEG0
    // COM Output Scan Direction
    OLED_Write(0xC8);             // C0 is COM0 to COMn, C8 is COMn to COM0

    // COM Pins Hardware Configuration
    OLED_Write(0xDA);             // set pins hardware configuration
    OLED_Write(0x12);

    // Multiplex Ratio
    OLED_Write(0xA8);             // set multiplex ratio
    OLED_Write(0x3F);             // set to 64 mux

    // Display Clock Divide
    OLED_Write(0xD5);             // set display clock divide
    OLED_Write(0xA0);             // set to 100Hz

    // Contrast Control Register
    OLED_Write(0x81);             // Set contrast control
    OLED_Write(0x60);             // display 0 ~ 127; 2C

    // Display Offset
    OLED_Write(0xD3);             // set display offset
    OLED_Write(0x00);             // no offset

    //Normal or Inverse Display
    OLED_Write(0xA6);             // Normal display

    OLED_Write(0xAD);             // Set DC-DC
    OLED_Write(0x8B);             // 8B=ON, 8A=OFF

    // Display ON/OFF
    OLED_Write(0xAF);             // AF=ON, AE=OFF

    DelayMs(150);

    // Entire Display ON/OFF
    OLED_Write(0xA4);             // A4=ON
    // Display Start Line
    OLED_Write(0x40);             // Set display start line
    // Lower Column Address
    OLED_Write(0x00 + OFFSET);    // Set lower column address
    // Higher Column Address
    OLED_Write(0x10);             // Set higher column address

    DelayMs(1);

    OLED_Clear();

    OLED_Deselect();
    OLED_SetData();
}

void OLED_Clear(void) {
    OLED_Set_Color(0);
    ClearDevice();
}

static void OLED_SetRAMaddr(BYTE page/* ie, row+xB0 */, BYTE column) {
    BYTE lowerAddr =  column    &0x0F;
    BYTE higherAddr= (column>>4)&0x0F;
    OLED_SetCommand(); 
    OLED_Write(page);
    OLED_Write(0x00+lowerAddr); 
    OLED_Write(0x10+higherAddr); 
    OLED_SetData();
}

void OLED_Set_Color(BYTE color) { _color = color; };


/*********************************************************************
* Function: Line
* Overview: 
* Input:
* Output: 
********************************************************************/
WORD OLED_Draw_Line(SHORT x1, SHORT y1, SHORT x2, SHORT y2)
{
    SHORT   deltaX, deltaY;
    SHORT   error, stepErrorLT, stepErrorGE;
    SHORT   stepX, stepY;
    SHORT   steep;
    SHORT   temp;
    SHORT   style, type;

    // Current line type
    SHORT   _lineType=0;
    
    // Current line thickness
    BYTE    _lineThickness=0;

    if(x1 == x2)
    {
        if(y1 > y2)
        {
            temp = y1;
            y1 = y2;
            y2 = temp;
        }
        style = 0;
        type = 1;
        for(temp = y1; temp < y2 + 1; temp++)
        {
            if((++style) == _lineType)
            {
                type ^= 1;
                style = 0;
            }
            if(type)
            {
                PutPixel(x1, temp);
                if(_lineThickness)
                {
                    PutPixel(x1 + 1, temp);
                    PutPixel(x1 - 1, temp);
                }
            }
        }
        return (1);
    }
    if(y1 == y2)
    {
        if(x1 > x2)
        {
            temp = x1;
            x1 = x2;
            x2 = temp;
        }
        style = 0;
        type = 1;
        for(temp = x1; temp < x2 + 1; temp++)
        {
            if((++style) == _lineType)
            {
                type ^= 1;
                style = 0;
            }
            if(type)
            {
                PutPixel(temp, y1);
                if(_lineThickness)
                {
                    PutPixel(temp, y1 + 1);
                    PutPixel(temp, y1 - 1);
                }
            }
        }
        return (1);
    }
    stepX = 0;
    deltaX = x2 - x1;
    if(deltaX < 0)
    {
        deltaX = -deltaX;
        --stepX;
    }
    else
    {
        ++stepX;
    }
    stepY = 0;
    deltaY = y2 - y1;
    if(deltaY < 0)
    {
        deltaY = -deltaY;
        --stepY;
    }
    else
    {
        ++stepY;
    }
    steep = 0;
    if(deltaX < deltaY)
    {
        ++steep;
        temp = deltaX;
        deltaX = deltaY;
        deltaY = temp;
        temp = x1;
        x1 = y1;
        y1 = temp;
        temp = stepX;
        stepX = stepY;
        stepY = temp;
        PutPixel(y1, x1);
    }
    else
    {
        PutPixel(x1, y1);
    }
    // If the current error greater or equal zero
    stepErrorGE = deltaX << 1;

    // If the current error less than zero
    stepErrorLT = deltaY << 1;

    // Error for the first pixel
    error = stepErrorLT - deltaX;

