galrene/bi-src/bi-src-pic24-all-labs_v9/src/sources/Microchip/PIC24F_StarterKit_OLED.c
#if 0
  /*********************************************************************
  * Function: OLED_PutROMStringInvertOption()
  * Overview: Prints ROM stored strings.           
  * Input: pointer to ROM stored string, page, column and invert option
  * Output: print the string on OLED_
  ********************************************************************/
  void OLED_PutROMStringInvertOption(ROM_STRING ptr, BYTE row, BYTE column, BOOL invert)
  {
    BYTE _column;
    
    if((page>=0)&&(page<8))
    {   
        _column = column;
        page += 0xB0;
        while(*ptr)
        {
            OLED_WriteOneChar(*ptr, page, _column, invert);
            ptr++;
            _column+=6;
        }
    }
  }
#endif

/*********************************************************************
* Function: OLED_PutStringInvertOption()
* Overview: Prints RAM stored strings..            
* Input: RAM string, page, column and invert option
* Output: print the string on OLED_
********************************************************************/
void OLED_PutStringInvertOption(const char* ptr, BYTE page, BYTE column, BOOL invert)
{
    BYTE _column;
    if((page>=0)&&(page<8))
    {   
        _column = column;
        page += 0xB0;
        while(*ptr)
        {
            OLED_WriteOneChar(*ptr,  page, _column, invert);
            ptr++;
            _column+=6;
        }
    }
}

#if 0
  void OLED_Scroll_Down(void) { // make room on top row
    BYTE p, j;
    OLED_Select();
    for(p=0xB7; p>0xB0; p--) { // Go through all 8 pages
        for(j = 0; j < 132; j++) {
            OLED_SetRAMaddr(p-1, j);
            OLED_Read(); // dummy read, as required for the SH1101A controller
            BYTE b = OLED_Read();
            OLED_SetRAMaddr(p, j);
            OLED_Write(b); 
        }
    }
    // clear top row
    OLED_SetRAMaddr(0xB0,0);
    for(j = 0; j < 132; j++) { OLED_Write(0); };
    OLED_Deselect();
  }
#endif

void OLED_Scroll_Up(void) { // make room for new bottom row
    BYTE p, j;
    OLED_Select();
    for(p=0xB0; p<0xB7; p++) { // Go through all 8 pages
        for(j = 0; j < 132; j++) {
            OLED_SetRAMaddr(p+1, j);
            OLED_Read(); // dummy read, as required for the SH1101A controller
            BYTE b = OLED_Read();
            OLED_SetRAMaddr(p, j);
            OLED_Write(b);
        }
    }
    // clear bottom row
    OLED_SetRAMaddr(0xB7,0);
    for(j = 0; j < 132; j++) { OLED_Write(0); };
    OLED_Deselect();
}

#if 0 // Dubious image-blast routine (check intent vs. use of "size" parameters)
  /*********************************************************************
  * Function: OLED_PutImage()
  * Overview: Puts on display ROM stored images.            
  * Input: pointer to ROM stored image array,
  * Output: 
  ********************************************************************/
  void OLED_PutImage(ROM_STRING ptr, BYTE sizex, BYTE sizey, BYTE startx, BYTE starty)
  {
    BYTE    _page, _column;

    startx += OFFSET;

    for(_page=(0xB0+starty); _page<(0xB0+sizey); _page++)
    {
        OLED_WriteCommand(+_page);
        OLED_WriteCommand(startx&0x0F);
        OLED_WriteCommand(0x10 | ((startx>>4)&0x0F));
        for(_column=0; _column<sizex; _column++)
        {
            OLED_WriteData(*ptr++);
        }
    }
  }

  ROM BYTE battery[5][34] = {
    { 0xF8, 0xE8, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x38, 0x20, 0xE0, 
      0x1F, 0x17, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1C, 0x04, 0x07 }, 

    { 0xF8, 0xE8, 0xE8, 0xE8, 0xE8, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x38, 0x20, 0xE0, 
      0x1F, 0x17, 0x17, 0x17, 0x17, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1C, 0x04, 0x07 }, 

    { 0xF8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0x08, 0x08, 0x08, 0x08, 0x08, 0x08, 0x38, 0x20, 0xE0, 
      0x1F, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1C, 0x04, 0x07 }, 

    { 0xF8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0x08, 0x08, 0x08, 0x38, 0x20, 0xE0, 
      0x1F, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x10, 0x10, 0x10, 0x1C, 0x04, 0x07 }, 

    { 0xF8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0xE8, 0x38, 0x20, 0xE0, 
      0x1F, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x17, 0x1C, 0x04, 0x07 } }; 

  ROM BYTE wifi[] = { 0xF0, 0x18, 0xF8, 0x38, 0xF8, 0x18, 0xF8, 0x58, 0xF8, 0x08, 0xE8, 0x28, 0x08, 0xA8, 0x08, 0xF0,
                    0x0F, 0x1C, 0x1B, 0x1C, 0x1B, 0x1C, 0x1F, 0x18, 0x1F, 0x10, 0x17, 0x11, 0x10, 0x17, 0x10, 0x0F };

  ROM BYTE bluetooth[] = { 0x00, 0x00, 0xE0, 0xF8, 0xFC, 0xDE, 0xBE, 0x02, 0x36, 0xAE, 0xDE, 0xFC, 0xF8, 0xE0, 0x00, 0x00,
                         0x00, 0x00, 0x07, 0x1F, 0x3F, 0x7B, 0x7D, 0x40, 0x6C, 0x75, 0x7B, 0x3F, 0x1F, 0x07, 0x00, 0x00 };

  ROM BYTE sound[5][36] = {     
    { 0x00, 0xC0, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
      0x00, 0x03, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, 

    { 0x00, 0xC0, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0x00, 0x40, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
      0x00, 0x03, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F, 0x00, 0x02, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, 

    { 0x00, 0xC0, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0x00, 0x40, 0x80, 0x08, 0x10, 0xE0, 0x00, 0x00, 0x00, 0x00, 
      0x00, 0x03, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F, 0x00, 0x02, 0x01, 0x10, 0x08, 0x07, 0x00, 0x00, 0x00, 0x00 }, 

    { 0x00, 0xC0, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0x00, 0x40, 0x80, 0x08, 0x10, 0xE2, 0x04, 0x04, 0x08, 0xF0, 
      0x00, 0x03, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F, 0x00, 0x02, 0x01, 0x10, 0x08, 0x47, 0x20, 0x20, 0x10, 0x0F }, 

    { 0x00, 0xC0, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE, 0x00, 0x40, 0x80, 0x08, 0x10, 0xE2, 0x04, 0x04, 0x08, 0xF0, 
      0x00, 0x03, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F, 0x00, 0x02, 0x01, 0x10, 0x08, 0x47, 0x20, 0x20, 0x10, 0x0F } }; 

#endif // unused image routine and examples
